In [1]:
import numpy as np
import pandas as pd

df = pd.read_csv('order_brush_order.csv')
df

               orderid     shopid     userid           event_time
0       31076582227611   93950878   30530270  2019-12-27 00:23:03
1       31118059853484  156423439   46057927  2019-12-27 11:54:20
2       31123355095755  173699291   67341739  2019-12-27 13:22:35
3       31122059872723   63674025  149380322  2019-12-27 13:01:00
4       31117075665123  127249066  149493217  2019-12-27 11:37:55
...                ...        ...        ...                  ...
222745  31245479170194  110868129  193218997  2019-12-28 23:17:59
222746  31230440360374   91639906    3541807  2019-12-28 19:07:20
222747  31191471145838   29391773  135908070  2019-12-28 08:17:52
222748  31198471732255   61556313   27306783  2019-12-28 10:14:31
222749  31164356713822  147941492  127484153  2019-12-28 00:45:56

[222750 rows x 4 columns]

In [2]:
df = df[df[['orderid','shopid','userid','event_time']].notnull()] #delete the null
df

               orderid     shopid     userid           event_time
0       31076582227611   93950878   30530270  2019-12-27 00:23:03
1       31118059853484  156423439   46057927  2019-12-27 11:54:20
2       31123355095755  173699291   67341739  2019-12-27 13:22:35
3       31122059872723   63674025  149380322  2019-12-27 13:01:00
4       31117075665123  127249066  149493217  2019-12-27 11:37:55
...                ...        ...        ...                  ...
222745  31245479170194  110868129  193218997  2019-12-28 23:17:59
222746  31230440360374   91639906    3541807  2019-12-28 19:07:20
222747  31191471145838   29391773  135908070  2019-12-28 08:17:52
222748  31198471732255   61556313   27306783  2019-12-28 10:14:31
222749  31164356713822  147941492  127484153  2019-12-28 00:45:56

[222750 rows x 4 columns]

In [3]:
df['year'] = pd.DatetimeIndex(df.event_time).year
df['month'] = pd.DatetimeIndex(df.event_time).month
df['day'] = pd.DatetimeIndex(df.event_time).day
df['hour'] = pd.DatetimeIndex(df.event_time).hour
df['mins'] = pd.DatetimeIndex(df.event_time).minute
print(df)

               orderid     shopid     userid           event_time  year  \
0       31076582227611   93950878   30530270  2019-12-27 00:23:03  2019
1       31118059853484  156423439   46057927  2019-12-27 11:54:20  2019
2       31123355095755  173699291   67341739  2019-12-27 13:22:35  2019
3       31122059872723   63674025  149380322  2019-12-27 13:01:00  2019
4       31117075665123  127249066  149493217  2019-12-27 11:37:55  2019
...                ...        ...        ...                  ...   ...
222745  31245479170194  110868129  193218997  2019-12-28 23:17:59  2019
222746  31230440360374   91639906    3541807  2019-12-28 19:07:20  2019
222747  31191471145838   29391773  135908070  2019-12-28 08:17:52  2019
222748  31198471732255   61556313   27306783  2019-12-28 10:14:31  2019
222749  31164356713822  147941492  127484153  2019-12-28 00:45:56  2019

        month  day  hour  mins
0          12   27     0    23
1          12   27    11    54
2          12   27    13    22
3          12   27    13     1
4          12   27    11    37
...       ...  ...   ...   ...
222745     12   28    23    17
222746     12   28    19     7
222747     12   28     8    17
222748     12   28    10    14
222749     12   28     0    45

[222750 rows x 9 columns]

In [4]:
shopcount = df.groupby(['shopid'],as_index=False)['shopid'].agg({'cnt':'count'}) #as_index:let shopid not to be index
shopcount

          shopid  cnt
0          10009    1
1          10051    2
2          10061    4
3          10084   55
4          10100   42
...          ...  ...
18765  214662358    1
18766  214949521    2
18767  214964814    1
18768  215175775    2
18769  215435223    1

[18770 rows x 2 columns]

In [5]:
df1 = shopcount[shopcount['cnt'] > 2].reset_index(drop=True)
df1

         shopid  cnt
0         10061    4
1         10084   55
2         10100   42
3         10132   10
4         10133   12
...         ...  ...
9026  213532450    6
9027  213675545    3
9028  213784505   11
9029  213900783    7
9030  214432425    4

[9031 rows x 2 columns]

In [6]:
del df1 ['cnt']

In [7]:
df2 = pd.merge(df,df1, left_on='shopid', right_on='shopid', how='inner') 
df2

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31076582227611,93950878,30530270,2019-12-27 00:23:03,2019,12,27,0,23
1,31424903151124,93950878,200055785,2019-12-31 01:08:23,2019,12,31,1,8
2,31328233643619,93950878,103695259,2019-12-29 22:17:13,2019,12,29,22,17
3,31370827295602,93950878,16996136,2019-12-30 10:07:07,2019,12,30,10,7
4,31149769932285,93950878,133955528,2019-12-27 20:42:49,2019,12,27,20,42
...,...,...,...,...,...,...,...,...,...
210352,31331203893505,121002027,26041616,2019-12-29 23:06:44,2019,12,29,23,6
210353,31302883603795,121002027,31083407,2019-12-29 15:14:43,2019,12,29,15,14
210354,31245556039835,132913029,39286035,2019-12-28 23:19:16,2019,12,28,23,19
210355,31485762402913,132913029,831655,2019-12-31 18:02:43,2019,12,31,18,2
210356,31323950770865,132913029,148895152,2019-12-29 21:05:50,2019,12,29,21,5

In [8]:
df2.sort_values(by=['shopid','event_time']).reset_index(drop=True)

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31195675919209,10061,168750452,2019-12-28 09:27:55,2019,12,28,9,27
1,31205132327893,10061,194819216,2019-12-28 12:05:32,2019,12,28,12,5
2,31412115824794,10061,130633421,2019-12-30 21:35:15,2019,12,30,21,35
3,31431527100615,10061,62464559,2019-12-31 02:58:48,2019,12,31,2,58
4,31075686185309,10084,4401933,2019-12-27 00:08:06,2019,12,27,0,8
...,...,...,...,...,...,...,...,...,...
210352,31407699385160,213900783,215251024,2019-12-30 20:21:39,2019,12,30,20,21
210353,31468414075366,214432425,1134243,2019-12-31 13:13:34,2019,12,31,13,13
210354,31505523761333,214432425,1134243,2019-12-31 23:32:03,2019,12,31,23,32
210355,31506349293329,214432425,52594422,2019-12-31 23:45:49,2019,12,31,23,45
210356,31506394434087,214432425,52594422,2019-12-31 23:46:35,2019,12,31,23,46

In [9]:
usercount = df.groupby(['userid'],as_index=False)['userid'].agg({'cnt':'count'}) #as_index:讓shopid不要變成index
usercount

          userid  cnt
0          10007    1
1          10020    1
2          10050    5
3          10057    3
4          10084    2
...          ...  ...
93878  215524270    1
93879  215524385    2
93880  215525117    1
93881  215525166    1
93882  215526246    1

[93883 rows x 2 columns]

In [10]:
df_user = usercount[usercount['cnt'] > 2].reset_index(drop=True)
df_user

          userid  cnt
0          10050    5
1          10057    3
2          10119    4
3          10165    8
4          10322   13
...          ...  ...
27582  215506490    3
27583  215506551    3
27584  215509264    4
27585  215509315    4
27586  215520413    3

[27587 rows x 2 columns]

In [11]:
del df_user ['cnt']

In [12]:
df3 = pd.merge(df2,df_user, left_on='userid', right_on='userid', how='inner')
df3

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31424903151124,93950878,200055785,2019-12-31 01:08:23,2019,12,31,1,8
1,31424903151122,64917226,200055785,2019-12-31 01:08:23,2019,12,31,1,8
2,31424903151123,90335842,200055785,2019-12-31 01:08:23,2019,12,31,1,8
3,31370827295602,93950878,16996136,2019-12-30 10:07:07,2019,12,30,10,7
4,31370827295608,66342314,16996136,2019-12-30 10:07:07,2019,12,30,10,7
...,...,...,...,...,...,...,...,...,...
128659,31321693256552,203596828,16873577,2019-12-29 20:28:14,2019,12,29,20,28
128660,31142028723527,157939195,69563623,2019-12-27 18:33:48,2019,12,27,18,33
128661,31142102987828,157939195,69563623,2019-12-27 18:35:02,2019,12,27,18,35
128662,31142061920722,157939195,69563623,2019-12-27 18:34:21,2019,12,27,18,34
128663,31304024353343,195033390,214857157,2019-12-29 15:33:44,2019,12,29,15,33

In [13]:
df3.sort_values(by=['shopid','event_time']).reset_index(drop=True)

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31431527100615,10061,62464559,2019-12-31 02:58:48,2019,12,31,2,58
1,31077155357404,10084,13837190,2019-12-27 00:32:36,2019,12,27,0,32
2,31079024994425,10084,39828049,2019-12-27 01:03:44,2019,12,27,1,3
3,31079688206563,10084,73993513,2019-12-27 01:14:49,2019,12,27,1,14
4,31103178638264,10084,80643747,2019-12-27 07:46:18,2019,12,27,7,46
...,...,...,...,...,...,...,...,...,...
128659,31366152111175,213900783,16699499,2019-12-30 08:49:12,2019,12,30,8,49
128660,31468414075366,214432425,1134243,2019-12-31 13:13:34,2019,12,31,13,13
128661,31505523761333,214432425,1134243,2019-12-31 23:32:03,2019,12,31,23,32
128662,31506349293329,214432425,52594422,2019-12-31 23:45:49,2019,12,31,23,45
128663,31506394434087,214432425,52594422,2019-12-31 23:46:35,2019,12,31,23,46

In [14]:
shopcount1 = df3.groupby(['shopid'],as_index=False)['shopid'].agg({'cnt':'count'}) #as_index:讓shopid不要變成index
shopcount1

         shopid  cnt
0         10061    1
1         10084   30
2         10100   22
3         10132    1
4         10133    7
...         ...  ...
8769  213347293    1
8770  213508987    2
8771  213532450    1
8772  213900783    5
8773  214432425    4

[8774 rows x 2 columns]

In [15]:
df_shop = shopcount1[shopcount1['cnt'] > 2].reset_index(drop=True)
del df_shop['cnt']
df_shop

         shopid
0         10084
1         10100
2         10133
3         10151
4         10153
...         ...
6929  213138763
6930  213141071
6931  213144032
6932  213900783
6933  214432425

[6934 rows x 1 columns]

In [16]:
df4 = pd.merge(df3,df_shop, left_on='shopid', right_on='shopid', how='inner') 
df4

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31424903151124,93950878,200055785,2019-12-31 01:08:23,2019,12,31,1,8
1,31370827295602,93950878,16996136,2019-12-30 10:07:07,2019,12,30,10,7
2,31149769932285,93950878,133955528,2019-12-27 20:42:49,2019,12,27,20,42
3,31382237261324,93950878,8836682,2019-12-30 13:17:18,2019,12,30,13,17
4,31382525077702,93950878,153538082,2019-12-30 13:22:05,2019,12,30,13,22
...,...,...,...,...,...,...,...,...,...
125702,31459859085120,3678731,192904102,2019-12-31 10:50:59,2019,12,31,10,50
125703,31175512700801,3678731,192904102,2019-12-28 03:51:53,2019,12,28,3,51
125704,31142028723527,157939195,69563623,2019-12-27 18:33:48,2019,12,27,18,33
125705,31142102987828,157939195,69563623,2019-12-27 18:35:02,2019,12,27,18,35
125706,31142061920722,157939195,69563623,2019-12-27 18:34:21,2019,12,27,18,34

In [17]:
df5 = df4.groupby(['shopid','userid'],as_index=False)['userid'].agg({'cnt':'count'})
df5

           shopid     userid  cnt
0           10084    6488128    1
1           10084    8457753    1
2           10084    8838142    1
3           10084   13837190    1
4           10084   14062776    1
...           ...        ...  ...
111317  213900783   62505597    1
111318  213900783  124465026    2
111319  213900783  208784344    1
111320  214432425    1134243    2
111321  214432425   52594422    2

[111322 rows x 3 columns]

In [18]:
df6 = df5[df5['cnt'] > 2].reset_index(drop=True)
df6 = df6.sort_values(by=['shopid','cnt'],ascending = False).reset_index(drop=True)
df6

         shopid     userid  cnt
0     213141071  213646699    3
1     212089630  105664365    3
2     211245313   46875705    3
3     210197928   52867898    4
4     209326384    7794832    3
...         ...        ...  ...
2835      10287  198097381    3
2836      10287  214226569    3
2837      10208   11288307    3
2838      10159   62775725    3
2839      10159  214988798    3

[2840 rows x 3 columns]

In [19]:
n = len(df6)
i_list = []
x = 0
temp = df6.iloc[0,0]
temp_count = df6.iloc[0,2]
for i in range(n):
    if df6.iloc[i,0] == temp and df6.iloc[i,2] < temp_count:
        i_list.append(i)
    elif df6.iloc[i,0] != temp:
        temp = df6.iloc[i,0]
        temp_count = df6.iloc[i,2]
for i in range(len(i_list)):
    df6 = df6.drop(df6.index[[i_list[i]-x]])
    x = x+1

In [20]:
df6.reset_index(drop=True)

        shopid     userid  cnt
0    213141071  213646699    3
1    212089630  105664365    3
2    211245313   46875705    3
3    210197928   52867898    4
4    209326384    7794832    3
..         ...        ...  ...
907      10287  198097381    3
908      10287  214226569    3
909      10208   11288307    3
910      10159   62775725    3
911      10159  214988798    3

[912 rows x 3 columns]

In [21]:
id_pair = []
for i in range(len(df6)):
    id_pair.append((df6.iloc[i, 0], df6.iloc[i, 1]))

In [22]:
del df6['cnt']

In [23]:
id_list = []
for i in range(len(df6)):
    if df6.iloc[i, 0] not in id_list:
        id_list.append(df6.iloc[i, 0])
        
del_list = []
for j in range(len(df)):
    if df.iloc[j, 1] not in id_list:
        del_list.append(j)
        
df7 = df
y = 0
for k in range(len(del_list)):
    df7 = df7.drop(df7.index[[del_list[k]-y]])
    y = y + 1

In [24]:
df8 = df7.sort_values(by=['shopid','event_time']).reset_index(drop=True)
df8

,orderid,shopid,userid,event_time,year,month,day,hour,mins
0,31077233536358,10159,307560,2019-12-27 00:33:54,2019,12,27,0,33
1,31080507811981,10159,130425036,2019-12-27 01:28:28,2019,12,27,1,28
2,31111812977491,10159,74643517,2019-12-27 10:10:12,2019,12,27,10,10
3,31116453085564,10159,190478358,2019-12-27 11:27:33,2019,12,27,11,27
4,31123850170394,10159,79929049,2019-12-27 13:30:50,2019,12,27,13,30
...,...,...,...,...,...,...,...,...,...
73996,31451185029030,212089630,105664365,2019-12-31 08:26:26,2019,12,31,8,26
73997,31454849817709,212089630,105664365,2019-12-31 09:27:30,2019,12,31,9,27
73998,31079802560868,213141071,213646699,2019-12-27 01:16:42,2019,12,27,1,16
73999,31080726584115,213141071,213646699,2019-12-27 01:32:07,2019,12,27,1,32
74000,31081343380652,213141071,213646699,2019-12-27 01:42:23,2019,12,27,1,42

In [25]:
from datetime import datetime, timedelta
dateFormatter = "%Y-%m-%d %H:%M:%S"
temp_list = []
final = []

for i in range(0,len(df8)):
    temp_shopid = df8.iloc [i, 1]
    temp_event_time = df8.iloc [i, 3]
    count = 0
    temp_list = []
    for j in range(i,len(df8)):
        if df8.iloc [j, 1] == temp_shopid and (datetime.strptime(df8.iloc [j, 3], dateFormatter) - datetime.strptime(temp_event_time, dateFormatter)) <= timedelta(hours=1):
            if df8.iloc [j, 2] not in temp_list:
                count += 1
            temp_list.append(df8.iloc [j, 2])
        

        elif df8.iloc [j, 1] != temp_shopid or (datetime.strptime(df8.iloc [j, 3], dateFormatter) - datetime.strptime(temp_event_time, dateFormatter)) > timedelta(hours=1):
            if len(temp_list)/count >= 3:
                set_list = list(set(temp_list))
                for k in range(len(set_list)):
                    if temp_list.count(set_list[k]) >= 3 and [temp_shopid, set_list[k], temp_list.count(set_list[k])] not in final:
                        final.append([temp_shopid, set_list[k] ,temp_list.count(set_list[k])])
 
            break

In [26]:
final

[[10402, 77819, 3],
 [10536, 672345, 3],
 [42472, 740844, 3],
 [42818, 170385453, 5],
 [42818, 170385453, 4],
 [42818, 170385453, 3],
 [76934, 190449497, 4],
 [76934, 190449497, 3],
 [195531, 214992524, 4],
 [425364, 72914921, 3],
 [599533, 264511, 3],
 [605561, 181682008, 3],
 [722132, 7670129, 3],
 [731606, 75558350, 3],
 [736620, 62618064, 4],
 [736620, 62618064, 3],
 [823357, 188942105, 5],
 [1175477, 122277324, 3],
 [1532569, 181408876, 3],
 [2831130, 15053804, 5],
 [2831130, 15053804, 4],
 [2831130, 15053804, 3],
 [2856708, 123959597, 3],
 [3124091, 214568881, 3],
 [3701311, 80690628, 3],
 [4149345, 212325226, 3],
 [4888564, 143847348, 3],
 [8566282, 556867, 3],
 [8715449, 9753706, 3],
 [8996761, 162508227, 3],
 [8996761, 13135622, 3],
 [8996761, 137245836, 3],
 [8996761, 215382704, 4],
 [9372692, 139795934, 3],
 [9676950, 210920501, 3],
 [10199219, 8405753, 3],
 [10206302, 95058664, 4],
 [10206302, 95058664, 3],
 [10498480, 199416406, 3],
 [11342466, 152292010, 3],
 [11474437, 148215831, 3],
 [11612863, 214546342, 3],
 [11809607, 136680607, 3],
 [11849988, 148215831, 3],
 [11896733, 156614746, 3],
 [12078788, 214588488, 4],
 [12537642, 48412388, 3],
 [13735592, 215424202, 3],
 [14184981, 32594, 3],
 [14646941, 200925208, 3],
 [15920950, 211907762, 3],
 [16001939, 205729485, 3],
 [16001939, 205729485, 8],
 [16001939, 205729485, 10],
 [16001939, 205729485, 9],
 [16001939, 205729485, 7],
 [16001939, 205729485, 6],
 [16001939, 205729485, 5],
 [16001939, 205729485, 4],
 [16246487, 214300427, 6],
 [16246487, 214300427, 5],
 [16246487, 214300427, 4],
 [16246487, 214300427, 3],
 [16680589, 102125116, 4],
 [16680589, 102125116, 3],
 [16732896, 214094512, 3],
 [17011899, 115994773, 3],
 [17212658, 107170776, 3],
 [17219984, 154495684, 3],
 [18190345, 89014205, 3],
 [18229789, 192400689, 5],
 [18229789, 192400689, 4],
 [18229789, 192400689, 3],
 [19052728, 2824209, 3],
 [20522747, 170673735, 3],
 [22800308, 99997899, 3],
 [27015534, 188025647, 3],
 [27121667, 183926374, 3],
 [27476241, 174145893, 5],
 [27476241, 174145893, 4],
 [27476241, 174145893, 3],
 [27987240, 192785138, 4],
 [27987240, 192785138, 3],
 [28773787, 144248285, 3],
 [28812867, 199416406, 3],
 [29238238, 15861876, 3],
 [29650418, 138388930, 4],
 [29650418, 138388930, 3],
 [29979455, 107641182, 3],
 [30740877, 79239008, 3],
 [31614331, 105848455, 3],
 [32729279, 205785599, 3],
 [34923033, 156774808, 3],
 [35590237, 2097773, 3],
 [36641013, 92223139, 3],
 [40262957, 214804722, 3],
 [41246368, 81592089, 3],
 [43412276, 50672876, 3],
 [43596797, 214226569, 3],
 [45084184, 116055684, 3],
 [48961570, 2803721, 3],
 [48970010, 207880909, 3],
 [50682734, 214365114, 3],
 [50713918, 172106152, 3],
 [51134277, 29857724, 3],
 [51134277, 212200633, 3],
 [51487211, 214808165, 3],
 [52377417, 213919641, 4],
 [52377417, 213919641, 3],
 [54257623, 1974334, 3],
 [54257623, 107414154, 3],
 [54415227, 48207392, 3],
 [54593828, 214778616, 3],
 [58543771, 61893096, 3],
 [58722428, 12425335, 3],
 [58835561, 152352709, 3],
 [59617008, 80682958, 4],
 [59617008, 80682958, 3],
 [60587222, 33794624, 3],
 [63001696, 81928284, 3],
 [63001745, 101866283, 3],
 [63888299, 112649507, 3],
 [64369518, 172591713, 3],
 [64394533, 194833170, 7],
 [64394533, 194833170, 6],
 [64394533, 194833170, 5],
 [64394533, 194833170, 4],
 [64394533, 194833170, 3],
 [65453156, 29503, 3],
 [66232769, 215123671, 3],
 [66337054, 122507717, 3],
 [66391375, 194647522, 4],
 [66861410, 213502289, 3],
 [68478964, 29466045, 3],
 [68609828, 183440131, 8],
 [68609828, 183440131, 7],
 [68609828, 183440131, 6],
 [68609828, 183440131, 5],
 [68609828, 183440131, 4],
 [68609828, 183440131, 3],
 [68862371, 67554410, 3],
 [68986766, 10209247, 3],
 [71007731, 214778616, 3],
 [71168001, 11053808, 3],
 [73103155, 214628840, 4],
 [73103155, 214628840, 3],
 [73690472, 30244568, 3],
 [75326165, 177472272, 3],
 [75622223, 69523106, 3],
 [76668593, 215224309, 3],
 [78837196, 78903959, 4],
 [78837196, 78903959, 3],
 [80049863, 123158564, 4],
 [80049863, 123158564, 3],
 [80890996, 77374158, 3],
 [81190174, 77374158, 3],
 [83234229, 181942741, 4],
 [83234229, 181942741, 3],
 [83366265, 118860287, 6],
 [83366265, 118860287, 5],
 [83366265, 118860287, 4],
 [83366265, 118860287, 3],
 [83440756, 26570682, 3],
 [84866704, 65814291, 3],
 [86368642, 144612139, 3],
 [86822226, 211907762, 3],
 [87063118, 178640685, 3],
 [87621695, 87846708, 3],
 [87657406, 214094512, 3],
 [87845635, 215427525, 3],
 [89126206, 3295689, 3],
 [93358941, 79419297, 3],
 [94154189, 15826134, 3],
 [95139064, 189834273, 3],
 [95458810, 44959060, 3],
 [96460204, 193338089, 3],
 [96555082, 89312509, 3],
 [96757644, 215243653, 3],
 [96757706, 61348019, 3],
 [97167904, 214778616, 3],
 [98481320, 124597967, 3],
 [98481320, 124597967, 6],
 [98481320, 124597967, 5],
 [98793086, 142710562, 3],
 [99067259, 108402614, 3],
 [99836251, 197470611, 4],
 [99836251, 197470611, 3],
 [100446829, 2434757, 4],
 [100446829, 2434757, 3],
 [103715156, 214226569, 3],
 [104245736, 188187242, 3],
 [104457555, 214778616, 3],
 [104590058, 81928284, 3],
 [104590579, 213714377, 3],
 [104955370, 10051694, 3],
 [105064701, 214431654, 3],
 [106051591, 1276208, 4],
 [106051591, 1276208, 3],
 [106390103, 51759862, 3],
 [107189025, 159315857, 3],
 [108120403, 212200633, 3],
 [108170744, 31233680, 3],
 [109628767, 214345977, 3],
 [110641390, 157946285, 3],
 [110871170, 133542654, 3],
 [114016125, 214705976, 3],
 [115506347, 200925208, 3],
 [116337057, 193415051, 3],
 [116348362, 870607, 3],
 [117079735, 37915675, 3],
 [118139770, 46361526, 4],
 [118139770, 46361526, 3],
 [118949192, 211604080, 3],
 [119309887, 48412388, 3],
 [119362482, 92275977, 3],
 [119595148, 17722130, 3],
 [119690532, 21402690, 3],
 [120692254, 214265994, 3],
 [122238789, 51759862, 3],
 [123401085, 12869645, 4],
 [123401085, 12869645, 3],
 [123548863, 131515076, 4],
 [123548863, 131515076, 3],
 [126261266, 76441165, 3],
 [126587078, 26670670, 3],
 [126599655, 214327515, 4],
 [126599655, 214327515, 3],
 [126639670, 101296643, 3],
 [128299931, 215009429, 3],
 [128300567, 215236192, 3],
 [129113839, 215408773, 3],
 [129460270, 48412388, 3],
 [130098983, 179997347, 3],
 [130100254, 18688337, 3],
 [130118966, 86802680, 3],
 [130168935, 31892574, 3],
 [130665582, 141499072, 3],
 [131387639, 192251866, 3],
 [131670390, 214094512, 3],
 [132583615, 152710183, 3],
 [132834615, 159124456, 3],
 [132964122, 142710562, 3],
 [133255677, 178640685, 3],
 [134418456, 214778616, 3],
 [134968430, 59725263, 3],
 [135644492, 40929352, 3],
 [136564914, 191211430, 3],
 [136564914, 178491887, 11],
 [136564914, 178491887, 16],
 [136564914, 178491887, 15],
 [136564914, 178491887, 14],
 [136564914, 178491887, 13],
 [136564914, 178491887, 12],
 [136564914, 178491887, 10],
 [136564914, 178491887, 9],
 [136564914, 178491887, 8],
 [136564914, 178491887, 7],
 [136564914, 178491887, 6],
 [136564914, 178491887, 5],
 [136564914, 178491887, 4],
 [136564914, 178491887, 3],
 [137762841, 62080153, 7],
 [137762841, 62080153, 6],
 [137762841, 62080153, 5],
 [137762841, 62080153, 4],
 [137762841, 62080153, 3],
 [138810304, 58467478, 4],
 [138810304, 58467478, 3],
 [139383672, 214898782, 3],
 [139743785, 179065138, 3],
 [140626153, 86570212, 3],
 [141025402, 613919, 3],
 [141828266, 31713663, 3],
 [143281052, 186080843, 3],
 [143281052, 99517130, 3],
 [143613660, 67554410, 4],
 [143613660, 67554410, 3],
 [143899665, 215408773, 3],
 [144365607, 214411855, 3],
 [145777302, 201343856, 7],
 [145986052, 63120351, 3],
 [148856653, 199382229, 3],
 [148917764, 189631941, 3],
 [149725779, 70086843, 3],
 [150526730, 108214177, 3],
 [152234237, 36097212, 4],
 [152234237, 36097212, 3],
 [152911522, 215169091, 3],
 [153335627, 111390406, 3],
 [153444897, 169948888, 3],
 [153672697, 214778616, 3],
 [155016230, 188431260, 3],
 [155143347, 214265994, 3],
 [155143347, 156202149, 3],
 [156246169, 214778616, 3],
 [156883302, 188025647, 5],
 [156883302, 76102350, 5],
 [156995951, 204919399, 3],
 [157633413, 202607600, 3],
 [157830762, 120099470, 3],
 [157939195, 69563623, 3],
 [160135616, 13949927, 3],
 [161160594, 74027394, 3],
 [161196859, 180862522, 3],
 [161277691, 212200872, 3],
 [162043213, 203554877, 3],
 [162282525, 162389170, 3],
 [162292584, 119654795, 5],
 [162292584, 119654795, 4],
 [162292584, 119654795, 3],
 [163351089, 214778616, 3],
 [163968828, 78903959, 3],
 [165020094, 214617593, 3],
 [165500538, 93783570, 3],
 [167068287, 199416406, 3],
 [168046193, 6059093, 3],
 [168388504, 148215831, 3],
 [168750844, 193338089, 3],
 [169902791, 50198835, 3],
 [171407673, 211296094, 3],
 [172406176, 215115251, 3],
 [172439621, 1866916, 4],
 [172439621, 1866916, 3],
 [173186657, 96046105, 3],
 [173318671, 215301243, 3],
 [173454640, 12597591, 3],
 [173478708, 81928284, 3],
 [173508019, 132704747, 4],
 [173508019, 132704747, 3],
 [175531295, 187697407, 3],
 [175531295, 215009429, 3],
 [177817260, 98709440, 5],
 [177817260, 98709440, 4],
 [177817260, 98709440, 3],
 [178273138, 71152760, 3],
 [181009364, 214208720, 3],
 [181009364, 101832161, 3],
 [181744029, 199382229, 3],
 [182541768, 210932914, 4],
 [182541768, 210932914, 3],
 [182630287, 158048102, 5],
 [182630287, 158048102, 4],
 [182630287, 158048102, 3],
 [182853378, 144902703, 3],
 [186369695, 174783274, 3],
 [188323737, 31215088, 3],
 [188546697, 31916119, 4],
 [188546697, 31916119, 3],
 [189308408, 27456547, 3],
 [189544563, 799445, 3],
 [191285578, 214925963, 3],
 [191449441, 191211430, 4],
 [191449441, 191211430, 3],
 [191674006, 179171579, 3],
 [192608876, 213646699, 3],
 [192919438, 4624716, 3],
 [193424291, 1762129, 3],
 [195870375, 105935455, 3],
 [198172755, 129799840, 3],
 [201185983, 34132265, 3],
 [201428849, 89254393, 3],
 [201557550, 214605778, 3],
 [203070501, 189834273, 3],
 [203440274, 73308605, 3],
 [203531250, 114282846, 4],
 [203531250, 114282846, 3],
 [204225676, 198662175, 5],
 [204225676, 198662175, 4],
 [204225676, 198662175, 3],
 [208696908, 214111334, 3],
 [210197928, 52867898, 4],
 [210197928, 52867898, 3]]

In [27]:
from pandas.core.frame import DataFrame
data=DataFrame(final)
data

             0          1  2
0        10402      77819  3
1        10536     672345  3
2        42472     740844  3
3        42818  170385453  5
4        42818  170385453  4
..         ...        ... ..
367  204225676  198662175  4
368  204225676  198662175  3
369  208696908  214111334  3
370  210197928   52867898  4
371  210197928   52867898  3

[372 rows x 3 columns]

In [28]:
data1 = data.sort_values(by=[0,2],ascending = False).reset_index(drop=True)
data1

             0          1  2
0    210197928   52867898  4
1    210197928   52867898  3
2    208696908  214111334  3
3    204225676  198662175  5
4    204225676  198662175  4
..         ...        ... ..
367      42818  170385453  4
368      42818  170385453  3
369      42472     740844  3
370      10536     672345  3
371      10402      77819  3

[372 rows x 3 columns]

In [29]:
data2 = data1.rename(columns = {0:'shopid', 1:'userid', 2:'cnt'})
data2

        shopid     userid  cnt
0    210197928   52867898    4
1    210197928   52867898    3
2    208696908  214111334    3
3    204225676  198662175    5
4    204225676  198662175    4
..         ...        ...  ...
367      42818  170385453    4
368      42818  170385453    3
369      42472     740844    3
370      10536     672345    3
371      10402      77819    3

[372 rows x 3 columns]

In [30]:
temp_shopid = data2.iloc[0, 0]
temp_count = data2.iloc[0, 2]
final_del_list = []

for i in range(len(data2)):
    if data2.iloc[i, 0] == temp_shopid and data2.iloc[i, 2] < temp_count:
        final_del_list.append(i)
    elif data2.iloc[i, 0] != temp_shopid:
        temp_shopid = data2.iloc[i, 0]
        temp_count = data2.iloc[i, 2]

z =  0
for j in range(len(final_del_list)):
    data2 = data2.drop(data2.index[[final_del_list[j]-z]])
    z = z + 1

final = data2.reset_index(drop=True)
final

        shopid     userid  cnt
0    210197928   52867898    4
1    208696908  214111334    3
2    204225676  198662175    5
3    203531250  114282846    4
4    203440274   73308605    3
..         ...        ...  ...
277      76934  190449497    4
278      42818  170385453    5
279      42472     740844    3
280      10536     672345    3
281      10402      77819    3

[282 rows x 3 columns]

In [31]:
same_list = []

for i in range(len(final)-1):
    if final.iloc[i, 0] == final.iloc[i+1, 0]:
        same_list.append(i+1)
        final.iloc[i,1] = str(final.iloc[i,1]) + "&" + str(final.iloc[i+1,1])


w = 0 
for j in range(len(same_list)):
    final= final.drop(final.index[[same_list[j]-w]])
    w = w + 1

final = final.reset_index(drop=True)
final

        shopid     userid  cnt
0    210197928   52867898    4
1    208696908  214111334    3
2    204225676  198662175    5
3    203531250  114282846    4
4    203440274   73308605    3
..         ...        ...  ...
270      76934  190449497    4
271      42818  170385453    5
272      42472     740844    3
273      10536     672345    3
274      10402      77819    3

[275 rows x 3 columns]

In [32]:
delete_list = []
for i in range(len(final)):
    if final.iloc[i, 0] not in delete_list:
        delete_list.append(final.iloc[i, 0])
        
del_list = []
for j in range(len(df)):
    if df.iloc[j, 1] in delete_list:
        del_list.append(j)

df_final = df
y = 0
for k in range(len(del_list)):
    df_final = df_final.drop(df_final.index[[del_list[k]-y]])
    y = y + 1

df_final['userid_final']=0

In [33]:
del df_final['orderid']
del df_final['userid']
del df_final['event_time']
del df_final['year']
del df_final['month']
del df_final['day']
del df_final['hour']
del df_final['mins']

In [34]:
df_final = df_final.groupby('shopid',as_index =False).sum()
df_final = df_final.rename(columns = {'userid_final':'userid'})
df_final

          shopid  userid
0          10009       0
1          10051       0
2          10061       0
3          10084       0
4          10100       0
...          ...     ...
18490  214662358       0
18491  214949521       0
18492  214964814       0
18493  215175775       0
18494  215435223       0

[18495 rows x 2 columns]

In [35]:
submission = pd.merge(final,df_final, left_on=['shopid','userid'], right_on=['shopid','userid'], how='outer')
submission
submission.to_csv('competition1_submission.csv', index = False)